src/cf/InformationRegisters/ор_ФальсификатыЛекарственныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_ФальсификатыЛекарственныхСредств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фальсифицирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ор_ФальсификатыЛекарственныхСредств/Forms/ФормаСопоставленияФальсификатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СписокСерий") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	СписокСерий = Параметры.СписокСерий;
	
	ЗаполнитьТаблицуФальсификатов();
	
	Если ТаблицаФальсификатов.Количество() = 0 Тогда
		
		Отказ = Истина;
		Если СписокСерий.Количество() = 0 Тогда
			Сообщение = НСтр("ru = 'Ни одного сопоставления фальсификатов не найдено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "СнятьВсе"
//
&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьФлагТаблицы(Ложь);
КонецПроцедуры

// Процедура - обработчик команды "УстановитьВсе"
//
&НаКлиенте
Процедура УстановитьВсе(Команда)
	УстановитьФлагТаблицы(Истина);
КонецПроцедуры

// Процедура - обработчик команды "ВыполнитьУстановкуФлага"
//
&НаКлиенте
Процедура ВыполнитьУстановкуФлага(Команда)
	
	СтруктураОтбораФальсификаты = Новый Структура();
	СтруктураОтбораФальсификаты.Вставить("Фальсификат", Истина);
	
	МассивСтрокСФлагами = ТаблицаФальсификатов.НайтиСтроки(СтруктураОтбораФальсификаты);
	ФлагиФальсифицированностиУказаны = МассивСтрокСФлагами.Количество() > 0;
	
	Если НЕ ФлагиФальсифицированностиУказаны Тогда
		Сообщение = НСтр("ru = 'Необходимо выбрать хотя бы один фальсификат.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыполнитьУстановкуФлагаЗавершение",
		ЭтотОбъект);
	Если ФлагиФальсифицированностиУказаны Тогда
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Изменить состояние фальсифицированности у выбранных серий?'"),
			РежимДиалогаВопрос.ДаНет,,,
			НСтр("ru = 'Изменить признак фальсификата?'"));
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьУстановкуФлагаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = УстановитьФлагФальсифицированности();
	Закрыть(РезультатВыполнения);
	
КонецПроцедуры

// Процедура выполняет заполнение таблицы фальсификатов
//
&НаСервере
Процедура ЗаполнитьТаблицуФальсификатов()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Серия,
	|	Фальсификаты.НаименованиеНоменклатуры КАК Наименование,
	|	ЛОЖЬ КАК Фальсификат,
	|	ХарактеристикиНоменклатуры.ор_Фальсификат КАК Состояние
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ор_ФальсификатыЛекарственныхСредств КАК Фальсификаты
	|		ПО ХарактеристикиНоменклатуры.ор_СерияПроизводителя = Фальсификаты.Серия
	|ГДЕ
	|	(НЕ ХарактеристикиНоменклатуры.ор_Фальсификат = Фальсификаты.Фальсифицирован)
	|	И &УСЛОВИЕ_СЕРИЙ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Состояние, Серия");
	
	Если СписокСерий.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &УСЛОВИЕ_СЕРИЙ", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_СЕРИЙ", " (ХарактеристикиНоменклатуры.Ссылка В (&СписокСерий))");
		Запрос.УстановитьПараметр("СписокСерий", СписокСерий.ВыгрузитьЗначения());
	КонецЕсли;
	
	ТаблицаФальсификатов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого ТекСтрока Из ТаблицаФальсификатов Цикл
		Номенклатура = СокрЛП(ТекСтрока.Номенклатура.Наименование);
		ЕстьПробел = Найти(Номенклатура, " ");
		ПервоеСлово = ?(ЕстьПробел = 0, Номенклатура, Лев(Номенклатура, ЕстьПробел - 1));
		
		Если Найти(ТекСтрока.Наименование, ПервоеСлово) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрока.Фальсификат = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет установку флага фальсифицированности
//
&НаСервере
Функция УстановитьФлагФальсифицированности()
	
	ТекстОшибок = "";
	ТекСерия = Неопределено;
	
	Для Каждого ТекСтрока Из ТаблицаФальсификатов Цикл
		Если НЕ ТекСтрока.Фальсификат Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСерия = ТекСтрока.Серия Тогда
			Продолжить;
		Иначе
			ТекСерия = ТекСтрока.Серия;
		КонецЕсли;
		
		СерияОбъект = ТекСтрока.Серия.ПолучитьОбъект();
		СерияОбъект.ор_Фальсификат = НЕ ТекСтрока.Состояние;
		
		Попытка
			СерияОбъект.Записать();
		Исключение
			ТекстОшибок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1%2Не удалось записать серию: %3 номенклатура: %4.'"),
				ТекстОшибок,
				?(ПустаяСтрока(ТекстОшибок), "", Символы.ПС),
				СерияОбъект,
				СерияОбъект.Владелец);
		КонецПопытки
	КонецЦикла;
	
	Если НЕ ТекстОшибок = "" Тогда
		Сообщение = НСтр("ru = 'Выполнено с ошибками:'") + Символы.ПС + ТекстОшибок;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Процедура выполняет установку флажков в таблице в переданное значение
//
&НаСервере
Процедура УстановитьФлагТаблицы(ЗначениеФлага)
	
	Для Каждого Элемент Из ТаблицаФальсификатов Цикл
		Элемент.Фальсификат = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
